; ModuleID = 'palindrome.c'
source_filename = "palindrome.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@.str = private unnamed_addr constant [3 x i8] c"rb\00", align 1
@.str.2 = private unnamed_addr constant [24 x i8] c"\09\09Unable to open file\0A\0A\00", align 1
@.str.3 = private unnamed_addr constant [24 x i8] c"\09\09Unable to read file\0A\0A\00", align 1
@.str.4 = private unnamed_addr constant [34 x i8] c"\09\09Nope, that's not a palindrome\0A\0A\00", align 1
@.str.5 = private unnamed_addr constant [30 x i8] c"\09\09Yes, that's a palindrome!\0A\0A\00", align 1
@__angora_context = common thread_local global i32 0
@__angora_call_site = common thread_local global i32 0

; Function Attrs: nounwind uwtable
define i32 @check_palindrome(i8* nocapture readonly) local_unnamed_addr #0 !dbg !10 {
  %2 = load i32, i32* @__angora_call_site, !nosanitize !2
  %3 = load i32, i32* @__angora_context, !nosanitize !2
  %4 = xor i32 %3, %2, !nosanitize !2
  store i32 %4, i32* @__angora_context, !nosanitize !2
  %5 = alloca [64 x i8], align 16
  call void @llvm.dbg.value(metadata i8* %0, metadata !16, metadata !DIExpression()), !dbg !26

!11 = !DISubroutineType(types: !12)
!12 = !{!4, !13}
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!15 = !{!16, !17, !18, !19, !20, !21, !22}
!16 = !DILocalVariable(name: "buf", arg: 1, scope: !10, file: !1, line: 14, type: !13)
!17 = !DILocalVariable(name: "len", scope: !10, file: !1, line: 15, type: !4)
!18 = !DILocalVariable(name: "i", scope: !10, file: !1, line: 16, type: !4)
!19 = !DILocalVariable(name: "steps", scope: !10, file: !1, line: 17, type: !4)
!20 = !DILocalVariable(name: "pal", scope: !10, file: !1, line: 18, type: !4)
!21 = !DILocalVariable(name: "n", scope: !10, file: !1, line: 19, type: !4)
!22 = !DILocalVariable(name: "string", scope: !10, file: !1, line: 20, type: !23)
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 512, elements: !24)
!24 = !{!25}
!25 = !DISubrange(count: 64)
!26 = !DILocation(line: 14, column: 28, scope: !10)
!27 = !DILocation(line: 15, column: 9, scope: !10)
!28 = !DILocation(line: 18, column: 9, scope: !10)
!29 = !DILocation(line: 19, column: 19, scope: !10)
!30 = !DILocation(line: 19, column: 13, scope: !10)
!31 = !DILocation(line: 19, column: 9, scope: !10)
!32 = !DILocation(line: 20, column: 5, scope: !10)
!33 = !DILocation(line: 20, column: 10, scope: !10)
!34 = !DILocation(line: 16, column: 9, scope: !10)
!35 = !DILocation(line: 22, column: 19, scope: !36)
!36 = distinct !DILexicalBlock(scope: !37, file: !1, line: 22, column: 5)
!37 = distinct !DILexicalBlock(scope: !10, file: !1, line: 22, column: 5)
!38 = !DILocation(line: 22, column: 5, scope: !37)
!39 = !DILocation(line: 26, column: 5, scope: !40)
!40 = distinct !DILexicalBlock(scope: !10, file: !1, line: 26, column: 5)
!41 = !DILocation(line: 23, column: 16, scope: !42)
!42 = distinct !DILexicalBlock(scope: !36, file: !1, line: 22, column: 29)
!43 = !DILocation(line: 23, column: 9, scope: !42)
!44 = !DILocation(line: 23, column: 19, scope: !42)
!45 = !{!46, !46, i64 0}
!46 = !{!"omnipotent char", !47, i64 0}
!47 = !{!"Simple C/C++ TBAA"}
!48 = !DILocation(line: 22, column: 25, scope: !36)
!49 = distinct !{!49, !38, !50}
!50 = !DILocation(line: 24, column: 5, scope: !37)
!51 = !DILocation(line: 27, column: 21, scope: !52)
!52 = distinct !DILexicalBlock(scope: !53, file: !1, line: 26, column: 29)
!53 = distinct !DILexicalBlock(scope: !40, file: !1, line: 26, column: 5)
!54 = !DILocation(line: 27, column: 9, scope: !52)
!55 = !DILocation(line: 27, column: 19, scope: !52)
!56 = !DILocation(line: 26, column: 25, scope: !53)
!57 = !DILocation(line: 26, column: 19, scope: !53)
!58 = distinct !{!58, !39, !59}
!59 = !DILocation(line: 28, column: 5, scope: !40)
!60 = !DILocation(line: 30, column: 17, scope: !61)
!61 = distinct !DILexicalBlock(scope: !62, file: !1, line: 30, column: 5)
!62 = distinct !DILexicalBlock(scope: !10, file: !1, line: 30, column: 5)
!63 = !DILocation(line: 30, column: 27, scope: !61)
!64 = !DILocation(line: 30, column: 5, scope: !62)
!65 = !DILocation(line: 34, column: 9, scope: !10)
!66 = !DILocation(line: 31, column: 12, scope: !67)
!67 = distinct !DILexicalBlock(scope: !61, file: !1, line: 30, column: 41)
!68 = !DILocation(line: 30, column: 37, scope: !61)
!69 = distinct !{!69, !64, !70}
!70 = !DILocation(line: 32, column: 5, scope: !62)
!71 = !DILocation(line: 34, column: 13, scope: !72)
!72 = distinct !DILexicalBlock(scope: !10, file: !1, line: 34, column: 9)
!73 = !DILocation(line: 34, column: 17, scope: !72)
!74 = !DILocation(line: 17, column: 9, scope: !10)
!75 = !DILocation(line: 36, column: 5, scope: !76)
!76 = distinct !DILexicalBlock(scope: !72, file: !1, line: 34, column: 23)
!77 = !DILocation(line: 39, column: 41, scope: !78)
!78 = distinct !DILexicalBlock(scope: !79, file: !1, line: 39, column: 13)
!79 = distinct !DILexicalBlock(scope: !80, file: !1, line: 38, column: 36)
!80 = distinct !DILexicalBlock(scope: !81, file: !1, line: 38, column: 5)
!81 = distinct !DILexicalBlock(scope: !10, file: !1, line: 38, column: 5)
!82 = !DILocation(line: 39, column: 26, scope: !78)
!83 = !DILocation(line: 39, column: 23, scope: !78)
!84 = !DILocation(line: 39, column: 13, scope: !79)
!85 = !DILocation(line: 41, column: 9, scope: !86)
!86 = distinct !DILexicalBlock(scope: !78, file: !1, line: 39, column: 47)
!87 = !DILocation(line: 0, scope: !10)
!88 = !DILocation(line: 45, column: 1, scope: !10)
!89 = !DILocation(line: 44, column: 5, scope: !10)
!90 = distinct !DISubprogram(name: "main", scope: !1, file: !1, line: 48, type: !91, isLocal: false, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !94)
!91 = !DISubroutineType(types: !92)
!92 = !{!4, !4, !93}
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!94 = !{!95, !96, !97, !158, !159, !160}
!95 = !DILocalVariable(name: "argc", arg: 1, scope: !90, file: !1, line: 48, type: !4)
!96 = !DILocalVariable(name: "argv", arg: 2, scope: !90, file: !1, line: 48, type: !93)
!97 = !DILocalVariable(name: "fd", scope: !90, file: !1, line: 50, type: !98)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !100, line: 7, baseType: !101)
!100 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "/home/seshagiri/work/angora/tests/test_dataset/palindrome")
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !102, line: 245, size: 1728, elements: !103)
!102 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/libio.h", directory: "/home/seshagiri/work/angora/tests/test_dataset/palindrome")
!103 = !{!104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !124, !125, !126, !127, !131, !133, !135, !139, !142, !144, !146, !147, !148, !149, !153, !154}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !101, file: !102, line: 246, baseType: !4, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !101, file: !102, line: 251, baseType: !13, size: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !101, file: !102, line: 252, baseType: !13, size: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !101, file: !102, line: 253, baseType: !13, size: 64, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !101, file: !102, line: 254, baseType: !13, size: 64, offset: 256)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !101, file: !102, line: 255, baseType: !13, size: 64, offset: 320)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !101, file: !102, line: 256, baseType: !13, size: 64, offset: 384)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !101, file: !102, line: 257, baseType: !13, size: 64, offset: 448)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !101, file: !102, line: 258, baseType: !13, size: 64, offset: 512)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !101, file: !102, line: 260, baseType: !13, size: 64, offset: 576)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !101, file: !102, line: 261, baseType: !13, size: 64, offset: 640)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !101, file: !102, line: 262, baseType: !13, size: 64, offset: 704)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !101, file: !102, line: 264, baseType: !117, size: 64, offset: 768)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !102, line: 160, size: 192, elements: !119)
!119 = !{!120, !121, !123}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !118, file: !102, line: 161, baseType: !117, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !118, file: !102, line: 162, baseType: !122, size: 64, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !118, file: !102, line: 166, baseType: !4, size: 32, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !101, file: !102, line: 266, baseType: !122, size: 64, offset: 832)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !101, file: !102, line: 268, baseType: !4, size: 32, offset: 896)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !101, file: !102, line: 272, baseType: !4, size: 32, offset: 928)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !101, file: !102, line: 274, baseType: !128, size: 64, offset: 960)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !129, line: 140, baseType: !130)
!129 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/seshagiri/work/angora/tests/test_dataset/palindrome")
!130 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !101, file: !102, line: 278, baseType: !132, size: 16, offset: 1024)
!132 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !101, file: !102, line: 279, baseType: !134, size: 8, offset: 1040)
!134 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !101, file: !102, line: 280, baseType: !136, size: 8, offset: 1048)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 1)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !101, file: !102, line: 284, baseType: !140, size: 64, offset: 1088)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !102, line: 154, baseType: null)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !101, file: !102, line: 293, baseType: !143, size: 64, offset: 1152)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !129, line: 141, baseType: !130)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !101, file: !102, line: 301, baseType: !145, size: 64, offset: 1216)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !101, file: !102, line: 302, baseType: !145, size: 64, offset: 1280)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !101, file: !102, line: 303, baseType: !145, size: 64, offset: 1344)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !101, file: !102, line: 304, baseType: !145, size: 64, offset: 1408)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !101, file: !102, line: 306, baseType: !150, size: 64, offset: 1472)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !151, line: 62, baseType: !152)
!151 = !DIFile(filename: "/home/seshagiri/installed_apps/clang+llvm/lib/clang/7.0.1/include/stddef.h", directory: "/home/seshagiri/work/angora/tests/test_dataset/palindrome")
!152 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !101, file: !102, line: 307, baseType: !4, size: 32, offset: 1536)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !101, file: !102, line: 309, baseType: !155, size: 160, offset: 1568)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 160, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 20)
!158 = !DILocalVariable(name: "buf", scope: !90, file: !1, line: 51, type: !13)
!159 = !DILocalVariable(name: "result", scope: !90, file: !1, line: 52, type: !4)
!160 = !DILocalVariable(name: "ret", scope: !90, file: !1, line: 67, type: !150)
!161 = !DILocation(line: 48, column: 14, scope: !90)
!162 = !DILocation(line: 48, column: 27, scope: !90)
!163 = !DILocation(line: 54, column: 14, scope: !164)
!164 = distinct !DILexicalBlock(scope: !90, file: !1, line: 54, column: 9)
!165 = !DILocation(line: 54, column: 9, scope: !90)
!166 = !DILocation(line: 55, column: 9, scope: !167)
!167 = distinct !DILexicalBlock(scope: !164, file: !1, line: 54, column: 19)
!168 = !DILocation(line: 58, column: 17, scope: !169)
!169 = distinct !DILexicalBlock(scope: !90, file: !1, line: 58, column: 9)
!170 = !DILocation(line: 51, column: 11, scope: !90)
!171 = !DILocation(line: 58, column: 15, scope: !169)
!172 = !DILocation(line: 58, column: 9, scope: !90)
!173 = !DILocation(line: 59, column: 9, scope: !169)
!174 = !DILocation(line: 61, column: 16, scope: !90)
!175 = !{!176, !176, i64 0}
!176 = !{!"any pointer", !46, i64 0}
!177 = !DILocation(line: 61, column: 10, scope: !90)
!178 = !DILocation(line: 50, column: 11, scope: !90)
!179 = !DILocation(line: 63, column: 10, scope: !180)
!180 = distinct !DILexicalBlock(scope: !90, file: !1, line: 63, column: 9)
!181 = !DILocation(line: 63, column: 9, scope: !90)
!182 = !DILocation(line: 64, column: 9, scope: !183)
!183 = distinct !DILexicalBlock(scope: !180, file: !1, line: 63, column: 14)
!184 = !DILocation(line: 65, column: 5, scope: !183)
!185 = !DILocation(line: 67, column: 18, scope: !90)
!186 = !DILocation(line: 67, column: 12, scope: !90)
!187 = !DILocation(line: 68, column: 5, scope: !90)
!188 = !DILocation(line: 70, column: 13, scope: !189)
!189 = distinct !DILexicalBlock(scope: !90, file: !1, line: 70, column: 9)
!190 = !DILocation(line: 70, column: 9, scope: !90)
!191 = !DILocation(line: 71, column: 9, scope: !192)
!192 = distinct !DILexicalBlock(scope: !189, file: !1, line: 70, column: 20)
!193 = !DILocation(line: 72, column: 9, scope: !192)
!194 = !DILocation(line: 75, column: 14, scope: !90)
!195 = !DILocation(line: 52, column: 9, scope: !90)
!196 = !DILocation(line: 77, column: 16, scope: !197)
!197 = distinct !DILexicalBlock(scope: !90, file: !1, line: 77, column: 9)
!198 = !DILocation(line: 77, column: 9, scope: !90)
!199 = !DILocation(line: 78, column: 9, scope: !200)
!200 = distinct !DILexicalBlock(scope: !197, file: !1, line: 77, column: 22)
!201 = !DILocation(line: 79, column: 23, scope: !202)
!202 = distinct !DILexicalBlock(scope: !197, file: !1, line: 79, column: 16)
!203 = !DILocation(line: 79, column: 16, scope: !197)
!204 = !DILocation(line: 80, column: 9, scope: !205)
!205 = distinct !DILexicalBlock(scope: !202, file: !1, line: 79, column: 29)
!206 = !DILocation(line: 81, column: 5, scope: !205)
!207 = !DILocation(line: 82, column: 9, scope: !208)
!208 = distinct !DILexicalBlock(scope: !202, file: !1, line: 81, column: 12)
!209 = !DILocation(line: 0, scope: !169)
!210 = !DILocation(line: 86, column: 1, scope: !90)
