; ModuleID = 'palindrome/palindrome.c'
source_filename = "palindrome/palindrome.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@.str = internal unnamed_addr constant { [3 x i8], [61 x i8] } { [3 x i8] c"rb\00", [61 x i8] zeroinitializer }, align 32
@.str.2 = internal unnamed_addr constant { [24 x i8], [40 x i8] } { [24 x i8] c"\09\09Unable to open file\0A\0A\00", [40 x i8] zeroinitializer }, align 32
@.str.3 = internal unnamed_addr constant { [24 x i8], [40 x i8] } { [24 x i8] c"\09\09Unable to read file\0A\0A\00", [40 x i8] zeroinitializer }, align 32
@.str.4 = internal unnamed_addr constant { [34 x i8], [62 x i8] } { [34 x i8] c"\09\09Nope, that's not a palindrome\0A\0A\00", [62 x i8] zeroinitializer }, align 32
@.str.5 = internal unnamed_addr constant { [30 x i8], [34 x i8] } { [30 x i8] c"\09\09Yes, that's a palindrome!\0A\0A\00", [34 x i8] zeroinitializer }, align 32
@__angora_context = common thread_local global i32 0
@__angora_call_site = common thread_local global i32 0
@__angora_area_ptr = external global i8*
@__angora_cond_cmpid = external global i32
@__angora_prev_loc = common thread_local global i32 0

!49 = !{!"branch_weights", i32 1, i32 100000}
!50 = !{!51, !51, i64 0}
!51 = !{!"omnipotent char", !52, i64 0}
!52 = !{!"Simple C/C++ TBAA"}
!53 = !DILocation(line: 24, column: 16, scope: !48)
!54 = !DILocation(line: 24, column: 9, scope: !22)
!55 = !{!"branch_weights", i32 1, i32 1000}
!56 = !DILocation(line: 25, column: 19, scope: !57)
!57 = distinct !DILexicalBlock(scope: !48, file: !1, line: 24, column: 24)
!58 = !DILocation(line: 22, column: 9, scope: !22)
!59 = !DILocation(line: 26, column: 5, scope: !57)
!60 = !DILocation(line: 27, column: 19, scope: !61)
!61 = distinct !DILexicalBlock(scope: !48, file: !1, line: 26, column: 12)
!62 = !DILocation(line: 30, column: 5, scope: !22)
!63 = !DILocation(line: 0, scope: !22)
!64 = !DILocation(line: 30, column: 10, scope: !22)
!65 = !DILocation(line: 18, column: 9, scope: !22)
!66 = !DILocation(line: 32, column: 19, scope: !67)
!67 = distinct !DILexicalBlock(scope: !68, file: !1, line: 32, column: 5)
!68 = distinct !DILexicalBlock(scope: !22, file: !1, line: 32, column: 5)
!69 = !DILocation(line: 32, column: 5, scope: !68)
!70 = !DILocation(line: 36, column: 12, scope: !71)
!71 = distinct !DILexicalBlock(scope: !22, file: !1, line: 36, column: 5)
!72 = !DILocation(line: 36, column: 5, scope: !71)
!73 = !DILocation(line: 33, column: 16, scope: !74)
!74 = distinct !DILexicalBlock(scope: !67, file: !1, line: 32, column: 29)
!75 = !DILocation(line: 33, column: 9, scope: !74)
!76 = !DILocation(line: 33, column: 19, scope: !74)
!77 = !DILocation(line: 32, column: 25, scope: !67)
!78 = distinct !{!78, !69, !79}
!79 = !DILocation(line: 34, column: 5, scope: !68)
!80 = !DILocation(line: 37, column: 21, scope: !81)
!81 = distinct !DILexicalBlock(scope: !82, file: !1, line: 36, column: 29)
!82 = distinct !DILexicalBlock(scope: !71, file: !1, line: 36, column: 5)
!83 = !DILocation(line: 37, column: 9, scope: !81)
!84 = !DILocation(line: 37, column: 19, scope: !81)
!85 = !DILocation(line: 36, column: 25, scope: !82)
!86 = !DILocation(line: 36, column: 19, scope: !82)
!87 = distinct !{!87, !72, !88}
!88 = !DILocation(line: 38, column: 5, scope: !71)
!89 = !DILocation(line: 40, column: 12, scope: !90)
!90 = distinct !DILexicalBlock(scope: !22, file: !1, line: 40, column: 5)
!91 = !DILocation(line: 40, column: 17, scope: !92)
!92 = distinct !DILexicalBlock(scope: !90, file: !1, line: 40, column: 5)
!93 = !DILocation(line: 40, column: 27, scope: !92)
!94 = !DILocation(line: 40, column: 5, scope: !90)
!95 = !DILocation(line: 19, column: 9, scope: !22)
!96 = !DILocation(line: 49, column: 5, scope: !97)
!97 = distinct !DILexicalBlock(scope: !22, file: !1, line: 49, column: 5)
!98 = !DILocation(line: 41, column: 12, scope: !99)
!99 = distinct !DILexicalBlock(scope: !92, file: !1, line: 40, column: 41)
!100 = !DILocation(line: 40, column: 37, scope: !92)
!101 = distinct !{!101, !94, !102}
!102 = !DILocation(line: 42, column: 5, scope: !90)
!103 = !DILocation(line: 45, column: 13, scope: !104)
!104 = distinct !DILexicalBlock(scope: !22, file: !1, line: 45, column: 9)
!105 = !DILocation(line: 45, column: 17, scope: !104)
!106 = !DILocation(line: 45, column: 9, scope: !22)
!107 = !DILocation(line: 46, column: 14, scope: !108)
!108 = distinct !DILexicalBlock(scope: !104, file: !1, line: 45, column: 23)
!109 = !DILocation(line: 47, column: 5, scope: !108)
!110 = !DILocation(line: 49, column: 19, scope: !111)
!111 = distinct !DILexicalBlock(scope: !97, file: !1, line: 49, column: 5)
!112 = !DILocation(line: 49, column: 27, scope: !111)
!113 = !DILocation(line: 50, column: 20, scope: !114)
!114 = distinct !DILexicalBlock(scope: !115, file: !1, line: 50, column: 13)
!115 = distinct !DILexicalBlock(scope: !111, file: !1, line: 49, column: 36)
!116 = !DILocation(line: 50, column: 13, scope: !114)
!117 = !DILocation(line: 50, column: 41, scope: !114)
!118 = !DILocation(line: 50, column: 26, scope: !114)
!119 = !DILocation(line: 50, column: 23, scope: !114)
!120 = !DILocation(line: 50, column: 13, scope: !115)
!121 = !DILocation(line: 51, column: 17, scope: !122)
!122 = distinct !DILexicalBlock(scope: !114, file: !1, line: 50, column: 47)
!123 = !DILocation(line: 52, column: 9, scope: !122)
!124 = !DILocation(line: 53, column: 5, scope: !115)
!125 = !DILocation(line: 49, column: 32, scope: !111)
!126 = distinct !{!126, !96, !127}
!127 = !DILocation(line: 53, column: 5, scope: !97)
!128 = !DILocation(line: 0, scope: !122)
!129 = !DILocation(line: 56, column: 1, scope: !22)
!130 = distinct !DISubprogram(name: "main", scope: !1, file: !1, line: 59, type: !131, isLocal: false, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !134)
!131 = !DISubroutineType(types: !132)
!132 = !{!4, !4, !133}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!134 = !{!135, !136, !137, !197, !201, !202}
!135 = !DILocalVariable(name: "argc", arg: 1, scope: !130, file: !1, line: 59, type: !4)
!136 = !DILocalVariable(name: "argv", arg: 2, scope: !130, file: !1, line: 59, type: !133)
!137 = !DILocalVariable(name: "fd", scope: !130, file: !1, line: 61, type: !138)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !140, line: 7, baseType: !141)
!140 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "/home/seshagiri/work/angora/tests/test_dataset")
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !142, line: 245, size: 1728, elements: !143)
!142 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/libio.h", directory: "/home/seshagiri/work/angora/tests/test_dataset")
!143 = !{!144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !164, !165, !166, !167, !171, !173, !175, !179, !182, !184, !186, !187, !188, !189, !192, !193}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !141, file: !142, line: 246, baseType: !4, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !141, file: !142, line: 251, baseType: !25, size: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !141, file: !142, line: 252, baseType: !25, size: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !141, file: !142, line: 253, baseType: !25, size: 64, offset: 192)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !141, file: !142, line: 254, baseType: !25, size: 64, offset: 256)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !141, file: !142, line: 255, baseType: !25, size: 64, offset: 320)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !141, file: !142, line: 256, baseType: !25, size: 64, offset: 384)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !141, file: !142, line: 257, baseType: !25, size: 64, offset: 448)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !141, file: !142, line: 258, baseType: !25, size: 64, offset: 512)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !141, file: !142, line: 260, baseType: !25, size: 64, offset: 576)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !141, file: !142, line: 261, baseType: !25, size: 64, offset: 640)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !141, file: !142, line: 262, baseType: !25, size: 64, offset: 704)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !141, file: !142, line: 264, baseType: !157, size: 64, offset: 768)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !142, line: 160, size: 192, elements: !159)
!159 = !{!160, !161, !163}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !158, file: !142, line: 161, baseType: !157, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !158, file: !142, line: 162, baseType: !162, size: 64, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !158, file: !142, line: 166, baseType: !4, size: 32, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !141, file: !142, line: 266, baseType: !162, size: 64, offset: 832)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !141, file: !142, line: 268, baseType: !4, size: 32, offset: 896)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !141, file: !142, line: 272, baseType: !4, size: 32, offset: 928)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !141, file: !142, line: 274, baseType: !168, size: 64, offset: 960)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !169, line: 140, baseType: !170)
!169 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/seshagiri/work/angora/tests/test_dataset")
!170 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !141, file: !142, line: 278, baseType: !172, size: 16, offset: 1024)
!172 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !141, file: !142, line: 279, baseType: !174, size: 8, offset: 1040)
!174 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !141, file: !142, line: 280, baseType: !176, size: 8, offset: 1048)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 8, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 1)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !141, file: !142, line: 284, baseType: !180, size: 64, offset: 1088)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !142, line: 154, baseType: null)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !141, file: !142, line: 293, baseType: !183, size: 64, offset: 1152)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !169, line: 141, baseType: !170)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !141, file: !142, line: 301, baseType: !185, size: 64, offset: 1216)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !141, file: !142, line: 302, baseType: !185, size: 64, offset: 1280)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !141, file: !142, line: 303, baseType: !185, size: 64, offset: 1344)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !141, file: !142, line: 304, baseType: !185, size: 64, offset: 1408)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !141, file: !142, line: 306, baseType: !190, size: 64, offset: 1472)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !191, line: 62, baseType: !36)
!191 = !DIFile(filename: "/home/seshagiri/installed_apps/clang+llvm/lib/clang/7.0.1/include/stddef.h", directory: "/home/seshagiri/work/angora/tests/test_dataset")
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !141, file: !142, line: 307, baseType: !4, size: 32, offset: 1536)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !141, file: !142, line: 309, baseType: !194, size: 160, offset: 1568)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 160, elements: !195)
!195 = !{!196}
!196 = !DISubrange(count: 20)
!197 = !DILocalVariable(name: "buf", scope: !130, file: !1, line: 62, type: !198)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 1024, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 128)
!201 = !DILocalVariable(name: "result", scope: !130, file: !1, line: 63, type: !4)
!202 = !DILocalVariable(name: "ret", scope: !130, file: !1, line: 75, type: !190)
!203 = !DILocation(line: 60, scope: !130)
!204 = !DILocation(line: 62, column: 10, scope: !130)
!205 = !DILocation(line: 59, column: 14, scope: !130)
!206 = !DILocation(line: 59, column: 27, scope: !130)
!207 = !DILocation(line: 62, column: 5, scope: !130)
!208 = !DILocation(line: 65, column: 14, scope: !209)
!209 = distinct !DILexicalBlock(scope: !130, file: !1, line: 65, column: 9)
!210 = !DILocation(line: 65, column: 9, scope: !130)
!211 = !DILocation(line: 66, column: 9, scope: !212)
!212 = distinct !DILexicalBlock(scope: !209, file: !1, line: 65, column: 19)
!213 = !DILocation(line: 69, column: 16, scope: !130)
!214 = !{!215, !215, i64 0}
!215 = !{!"any pointer", !51, i64 0}
!216 = !DILocation(line: 69, column: 10, scope: !130)
!217 = !DILocation(line: 61, column: 11, scope: !130)
!218 = !DILocation(line: 71, column: 10, scope: !219)
!219 = distinct !DILexicalBlock(scope: !130, file: !1, line: 71, column: 9)
!220 = !DILocation(line: 71, column: 9, scope: !130)
!221 = !DILocation(line: 72, column: 9, scope: !222)
!222 = distinct !DILexicalBlock(scope: !219, file: !1, line: 71, column: 14)
!223 = !DILocation(line: 73, column: 5, scope: !222)
!224 = !DILocation(line: 75, column: 5, scope: !130)
!225 = !DILocation(line: 75, column: 18, scope: !130)
!226 = !DILocation(line: 75, column: 12, scope: !130)
!227 = !DILocation(line: 76, column: 5, scope: !130)
!228 = !DILocation(line: 78, column: 13, scope: !229)
!229 = distinct !DILexicalBlock(scope: !130, file: !1, line: 78, column: 9)
!230 = !DILocation(line: 78, column: 9, scope: !130)
!231 = !DILocation(line: 79, column: 9, scope: !232)
!232 = distinct !DILexicalBlock(scope: !229, file: !1, line: 78, column: 20)
!233 = !DILocation(line: 80, column: 9, scope: !232)
!234 = !DILocation(line: 83, column: 31, scope: !130)
!235 = !DILocation(line: 83, column: 14, scope: !130)
!236 = !DILocation(line: 63, column: 9, scope: !130)
!237 = !DILocation(line: 85, column: 16, scope: !238)
!238 = distinct !DILexicalBlock(scope: !130, file: !1, line: 85, column: 9)
!239 = !DILocation(line: 85, column: 9, scope: !130)
!240 = !DILocation(line: 86, column: 9, scope: !241)
!241 = distinct !DILexicalBlock(scope: !238, file: !1, line: 85, column: 22)
!242 = !DILocation(line: 87, column: 16, scope: !243)
!243 = distinct !DILexicalBlock(scope: !238, file: !1, line: 87, column: 16)
!244 = !DILocation(line: 87, column: 23, scope: !243)
!245 = !DILocation(line: 87, column: 16, scope: !238)
!246 = !DILocation(line: 88, column: 9, scope: !247)
!247 = distinct !DILexicalBlock(scope: !243, file: !1, line: 87, column: 29)
!248 = !DILocation(line: 89, column: 5, scope: !247)
!249 = !DILocation(line: 90, column: 9, scope: !250)
!250 = distinct !DILexicalBlock(scope: !243, file: !1, line: 89, column: 12)
!251 = !DILocation(line: 94, column: 1, scope: !130)
