; ModuleID = 'palindrome/palindrome.c'
source_filename = "palindrome/palindrome.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@.str = private unnamed_addr constant [3 x i8] c"rb\00", align 1
@.str.2 = private unnamed_addr constant [24 x i8] c"\09\09Unable to open file\0A\0A\00", align 1
@.str.3 = private unnamed_addr constant [24 x i8] c"\09\09Unable to read file\0A\0A\00", align 1
@.str.4 = private unnamed_addr constant [34 x i8] c"\09\09Nope, that's not a palindrome\0A\0A\00", align 1
@.str.5 = private unnamed_addr constant [30 x i8] c"\09\09Yes, that's a palindrome!\0A\0A\00", align 1
@__angora_context = common thread_local global i32 0
@__angora_call_site = common thread_local global i32 0

; Function Attrs: nounwind uwtable
define i32 @check_palindrome(i8* nocapture readonly) local_unnamed_addr #0 !dbg !10 {
  %2 = load i32, i32* @__angora_call_site, !dbg !29, !nosanitize !2
  %3 = load i32, i32* @__angora_context, !dbg !29, !nosanitize !2
  %4 = xor i32 %3, %2, !dbg !29, !nosanitize !2
  store i32 %4, i32* @__angora_context, !dbg !29, !nosanitize !2

!26 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, elements: !27)
!27 = !{!28}
!28 = !DISubrange(count: !23)
!29 = !DILocation(line: 16, column: 28, scope: !10)
!30 = !DILocation(line: 17, column: 9, scope: !10)
!31 = !DILocation(line: 20, column: 9, scope: !10)
!32 = !DILocation(line: 21, column: 19, scope: !10)
!33 = !DILocation(line: 21, column: 13, scope: !10)
!34 = !DILocation(line: 21, column: 9, scope: !10)
!35 = !DILocation(line: 24, column: 9, scope: !36)
!36 = distinct !DILexicalBlock(scope: !10, file: !1, line: 24, column: 9)
!37 = !{!38, !38, i64 0}
!38 = !{!"omnipotent char", !39, i64 0}
!39 = !{!"Simple C/C++ TBAA"}
!40 = !DILocation(line: 24, column: 16, scope: !36)
!41 = !DILocation(line: 24, column: 9, scope: !10)
!42 = !DILocation(line: 22, column: 9, scope: !10)
!43 = !DILocation(line: 26, column: 5, scope: !44)
!44 = distinct !DILexicalBlock(scope: !36, file: !1, line: 24, column: 24)
!45 = !DILocation(line: 30, column: 5, scope: !10)
!46 = !DILocation(line: 0, scope: !10)
!47 = !DILocation(line: 30, column: 10, scope: !10)
!48 = !DILocation(line: 18, column: 9, scope: !10)
!49 = !DILocation(line: 32, column: 19, scope: !50)
!50 = distinct !DILexicalBlock(scope: !51, file: !1, line: 32, column: 5)
!51 = distinct !DILexicalBlock(scope: !10, file: !1, line: 32, column: 5)
!52 = !DILocation(line: 32, column: 5, scope: !51)
!53 = !DILocation(line: 36, column: 5, scope: !54)
!54 = distinct !DILexicalBlock(scope: !10, file: !1, line: 36, column: 5)
!55 = !DILocation(line: 33, column: 16, scope: !56)
!56 = distinct !DILexicalBlock(scope: !50, file: !1, line: 32, column: 29)
!57 = !DILocation(line: 33, column: 9, scope: !56)
!58 = !DILocation(line: 33, column: 19, scope: !56)
!59 = !DILocation(line: 32, column: 25, scope: !50)
!60 = distinct !{!60, !52, !61}
!61 = !DILocation(line: 34, column: 5, scope: !51)
!62 = !DILocation(line: 37, column: 21, scope: !63)
!63 = distinct !DILexicalBlock(scope: !64, file: !1, line: 36, column: 29)
!64 = distinct !DILexicalBlock(scope: !54, file: !1, line: 36, column: 5)
!65 = !DILocation(line: 37, column: 9, scope: !63)
!66 = !DILocation(line: 37, column: 19, scope: !63)
!67 = !DILocation(line: 36, column: 25, scope: !64)
!68 = !DILocation(line: 36, column: 19, scope: !64)
!69 = distinct !{!69, !53, !70}
!70 = !DILocation(line: 38, column: 5, scope: !54)
!71 = !DILocation(line: 40, column: 17, scope: !72)
!72 = distinct !DILexicalBlock(scope: !73, file: !1, line: 40, column: 5)
!73 = distinct !DILexicalBlock(scope: !10, file: !1, line: 40, column: 5)
!74 = !DILocation(line: 40, column: 27, scope: !72)
!75 = !DILocation(line: 40, column: 5, scope: !73)
!76 = !DILocation(line: 19, column: 9, scope: !10)
!77 = !DILocation(line: 49, column: 5, scope: !78)
!78 = distinct !DILexicalBlock(scope: !10, file: !1, line: 49, column: 5)
!79 = !DILocation(line: 41, column: 12, scope: !80)
!80 = distinct !DILexicalBlock(scope: !72, file: !1, line: 40, column: 41)
!81 = !DILocation(line: 40, column: 37, scope: !72)
!82 = distinct !{!82, !75, !83}
!83 = !DILocation(line: 42, column: 5, scope: !73)
!84 = !DILocation(line: 45, column: 13, scope: !85)
!85 = distinct !DILexicalBlock(scope: !10, file: !1, line: 45, column: 9)
!86 = !DILocation(line: 45, column: 17, scope: !85)
!87 = !DILocation(line: 45, column: 9, scope: !10)
!88 = !DILocation(line: 47, column: 5, scope: !89)
!89 = distinct !DILexicalBlock(scope: !85, file: !1, line: 45, column: 23)
!90 = !DILocation(line: 49, column: 19, scope: !91)
!91 = distinct !DILexicalBlock(scope: !78, file: !1, line: 49, column: 5)
!92 = !DILocation(line: 49, column: 27, scope: !91)
!93 = !DILocation(line: 50, column: 20, scope: !94)
!94 = distinct !DILexicalBlock(scope: !95, file: !1, line: 50, column: 13)
!95 = distinct !DILexicalBlock(scope: !91, file: !1, line: 49, column: 36)
!96 = !DILocation(line: 50, column: 13, scope: !94)
!97 = !DILocation(line: 50, column: 41, scope: !94)
!98 = !DILocation(line: 50, column: 26, scope: !94)
!99 = !DILocation(line: 50, column: 23, scope: !94)
!100 = !DILocation(line: 50, column: 13, scope: !95)
!101 = !DILocation(line: 52, column: 9, scope: !102)
!102 = distinct !DILexicalBlock(scope: !94, file: !1, line: 50, column: 47)
!103 = !DILocation(line: 49, column: 32, scope: !91)
!104 = distinct !{!104, !77, !105}
!105 = !DILocation(line: 53, column: 5, scope: !78)
!106 = !DILocation(line: 0, scope: !102)
!107 = !DILocation(line: 56, column: 1, scope: !10)
!108 = distinct !DISubprogram(name: "main", scope: !1, file: !1, line: 59, type: !109, isLocal: false, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !112)
!109 = !DISubroutineType(types: !110)
!110 = !{!4, !4, !111}
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!112 = !{!113, !114, !115, !175, !179, !180}
!113 = !DILocalVariable(name: "argc", arg: 1, scope: !108, file: !1, line: 59, type: !4)
!114 = !DILocalVariable(name: "argv", arg: 2, scope: !108, file: !1, line: 59, type: !111)
!115 = !DILocalVariable(name: "fd", scope: !108, file: !1, line: 61, type: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !118, line: 7, baseType: !119)
!118 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "/home/seshagiri/work/angora/tests/test_dataset")
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !120, line: 245, size: 1728, elements: !121)
!120 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/libio.h", directory: "/home/seshagiri/work/angora/tests/test_dataset")
!121 = !{!122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !142, !143, !144, !145, !149, !151, !153, !157, !160, !162, !164, !165, !166, !167, !170, !171}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !119, file: !120, line: 246, baseType: !4, size: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !119, file: !120, line: 251, baseType: !13, size: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !119, file: !120, line: 252, baseType: !13, size: 64, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !119, file: !120, line: 253, baseType: !13, size: 64, offset: 192)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !119, file: !120, line: 254, baseType: !13, size: 64, offset: 256)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !119, file: !120, line: 255, baseType: !13, size: 64, offset: 320)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !119, file: !120, line: 256, baseType: !13, size: 64, offset: 384)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !119, file: !120, line: 257, baseType: !13, size: 64, offset: 448)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !119, file: !120, line: 258, baseType: !13, size: 64, offset: 512)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !119, file: !120, line: 260, baseType: !13, size: 64, offset: 576)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !119, file: !120, line: 261, baseType: !13, size: 64, offset: 640)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !119, file: !120, line: 262, baseType: !13, size: 64, offset: 704)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !119, file: !120, line: 264, baseType: !135, size: 64, offset: 768)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !120, line: 160, size: 192, elements: !137)
!137 = !{!138, !139, !141}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !136, file: !120, line: 161, baseType: !135, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !136, file: !120, line: 162, baseType: !140, size: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !136, file: !120, line: 166, baseType: !4, size: 32, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !119, file: !120, line: 266, baseType: !140, size: 64, offset: 832)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !119, file: !120, line: 268, baseType: !4, size: 32, offset: 896)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !119, file: !120, line: 272, baseType: !4, size: 32, offset: 928)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !119, file: !120, line: 274, baseType: !146, size: 64, offset: 960)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !147, line: 140, baseType: !148)
!147 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/seshagiri/work/angora/tests/test_dataset")
!148 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !119, file: !120, line: 278, baseType: !150, size: 16, offset: 1024)
!150 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !119, file: !120, line: 279, baseType: !152, size: 8, offset: 1040)
!152 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !119, file: !120, line: 280, baseType: !154, size: 8, offset: 1048)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8, elements: !155)
!155 = !{!156}
!156 = !DISubrange(count: 1)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !119, file: !120, line: 284, baseType: !158, size: 64, offset: 1088)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !120, line: 154, baseType: null)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !119, file: !120, line: 293, baseType: !161, size: 64, offset: 1152)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !147, line: 141, baseType: !148)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !119, file: !120, line: 301, baseType: !163, size: 64, offset: 1216)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !119, file: !120, line: 302, baseType: !163, size: 64, offset: 1280)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !119, file: !120, line: 303, baseType: !163, size: 64, offset: 1344)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !119, file: !120, line: 304, baseType: !163, size: 64, offset: 1408)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !119, file: !120, line: 306, baseType: !168, size: 64, offset: 1472)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !169, line: 62, baseType: !24)
!169 = !DIFile(filename: "/home/seshagiri/installed_apps/clang+llvm/lib/clang/7.0.1/include/stddef.h", directory: "/home/seshagiri/work/angora/tests/test_dataset")
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !119, file: !120, line: 307, baseType: !4, size: 32, offset: 1536)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !119, file: !120, line: 309, baseType: !172, size: 160, offset: 1568)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 160, elements: !173)
!173 = !{!174}
!174 = !DISubrange(count: 20)
!175 = !DILocalVariable(name: "buf", scope: !108, file: !1, line: 62, type: !176)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 1024, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 128)
!179 = !DILocalVariable(name: "result", scope: !108, file: !1, line: 63, type: !4)
!180 = !DILocalVariable(name: "ret", scope: !108, file: !1, line: 75, type: !168)
!181 = !DILocation(line: 59, column: 14, scope: !108)
!182 = !DILocation(line: 59, column: 27, scope: !108)
!183 = !DILocation(line: 62, column: 5, scope: !108)
!184 = !DILocation(line: 62, column: 10, scope: !108)
!185 = !DILocation(line: 65, column: 14, scope: !186)
!186 = distinct !DILexicalBlock(scope: !108, file: !1, line: 65, column: 9)
!187 = !DILocation(line: 65, column: 9, scope: !108)
!188 = !DILocation(line: 66, column: 9, scope: !189)
!189 = distinct !DILexicalBlock(scope: !186, file: !1, line: 65, column: 19)
!190 = !DILocation(line: 69, column: 16, scope: !108)
!191 = !{!192, !192, i64 0}
!192 = !{!"any pointer", !38, i64 0}
!193 = !DILocation(line: 69, column: 10, scope: !108)
!194 = !DILocation(line: 61, column: 11, scope: !108)
!195 = !DILocation(line: 71, column: 10, scope: !196)
!196 = distinct !DILexicalBlock(scope: !108, file: !1, line: 71, column: 9)
!197 = !DILocation(line: 71, column: 9, scope: !108)
!198 = !DILocation(line: 72, column: 9, scope: !199)
!199 = distinct !DILexicalBlock(scope: !196, file: !1, line: 71, column: 14)
!200 = !DILocation(line: 73, column: 5, scope: !199)
!201 = !DILocation(line: 75, column: 18, scope: !108)
!202 = !DILocation(line: 75, column: 12, scope: !108)
!203 = !DILocation(line: 76, column: 5, scope: !108)
!204 = !DILocation(line: 78, column: 13, scope: !205)
!205 = distinct !DILexicalBlock(scope: !108, file: !1, line: 78, column: 9)
!206 = !DILocation(line: 78, column: 9, scope: !108)
!207 = !DILocation(line: 79, column: 9, scope: !208)
!208 = distinct !DILexicalBlock(scope: !205, file: !1, line: 78, column: 20)
!209 = !DILocation(line: 80, column: 9, scope: !208)
!210 = !DILocation(line: 83, column: 14, scope: !108)
!211 = !DILocation(line: 63, column: 9, scope: !108)
!212 = !DILocation(line: 85, column: 16, scope: !213)
!213 = distinct !DILexicalBlock(scope: !108, file: !1, line: 85, column: 9)
!214 = !DILocation(line: 85, column: 9, scope: !108)
!215 = !DILocation(line: 86, column: 9, scope: !216)
!216 = distinct !DILexicalBlock(scope: !213, file: !1, line: 85, column: 22)
!217 = !DILocation(line: 87, column: 23, scope: !218)
!218 = distinct !DILexicalBlock(scope: !213, file: !1, line: 87, column: 16)
!219 = !DILocation(line: 87, column: 16, scope: !213)
!220 = !DILocation(line: 88, column: 9, scope: !221)
!221 = distinct !DILexicalBlock(scope: !218, file: !1, line: 87, column: 29)
!222 = !DILocation(line: 89, column: 5, scope: !221)
!223 = !DILocation(line: 90, column: 9, scope: !224)
!224 = distinct !DILexicalBlock(scope: !218, file: !1, line: 89, column: 12)
!225 = !DILocation(line: 94, column: 1, scope: !108)
